# DataFrame

In [1]:
import pandas as pd

In [3]:
dicionario = { 
    'Nome': ['Alice', 'Bento', 'Carla', 'Daniel'],
    'Idade': [25, 30, 35, 40],
    'Naturalidade':['SP', 'AM', 'RJ', 'SP']
}

df = pd.DataFrame(dicionario)
print(df)

     Nome  Idade Naturalidade
0   Alice     25           SP
1   Bento     30           AM
2   Carla     35           RJ
3  Daniel     40           SP

In [4]:
# Selecionando os primeiros registros do DataFrame
df.head()

     Nome  Idade Naturalidade
0   Alice     25           SP
1   Bento     30           AM
2   Carla     35           RJ
3  Daniel     40           SP

In [5]:
# Selecionando a coluna nome
df['Nome']

0     Alice
1     Bento
2     Carla
3    Daniel
Name: Nome, dtype: object

In [8]:
# Selecionando mais de uma coluna.
df[['Nome', 'Idade']]

     Nome  Idade
0   Alice     25
1   Bento     30
2   Carla     35
3  Daniel     40

In [10]:
# Selecionando por índice com o loc
df.loc[0]

Nome            Alice
Idade              25
Naturalidade       SP
Name: 0, dtype: object

In [12]:
# Selecionando por índice mais de 1 elemento o loc
df.loc[[0,2]]

    Nome  Idade Naturalidade
0  Alice     25           SP
2  Carla     35           RJ

In [13]:
# Selecionando elementos pelo rotulo. 
df.at[1, 'Nome']

'Bento'

In [14]:
# Buscando valores booleanos com Idade acima de 30. 
df['Idade']>30

0    False
1    False
2     True
3     True
Name: Idade, dtype: bool

In [15]:
df[df['Idade']>30]

     Nome  Idade Naturalidade
2   Carla     35           RJ
3  Daniel     40           SP

In [16]:
# 
df['Nome'] == 'Daniel'

0    False
1    False
2    False
3     True
Name: Nome, dtype: bool

In [17]:
# Buscando todos os dados que sejam igual a Daniel. 
df[df['Nome'] == 'Daniel']

     Nome  Idade Naturalidade
3  Daniel     40           SP